In [1]:
import numpy as np
import pandas as pd

# You can also use this section to suppress warnings generated by your code:
def warn(*args, **kwargs):
    pass
import warnings
warnings.warn = warn
warnings.filterwarnings('ignore')

# URL den bilgi çekme

In [2]:
URL="https://web.archive.org/web/20230902185326/https://en.wikipedia.org/wiki/List_of_countries_by_GDP_%28nominal%29"

# Extract tables from webpage using Pandas. Retain table number 3 as the required dataframe.

In [3]:
tables = pd.read_html(URL)

type(tables)

list

In [4]:
df = tables[3]

type(df)

df.head()

  Country/Territory UN region IMF[1][13]            World Bank[14]             \
  Country/Territory UN region   Estimate       Year       Estimate       Year
0             World         —  105568776       2023      100562011       2022
1     United States  Americas   26854599       2023       25462700       2022
2             China      Asia   19373586  [n 1]2023       17963171  [n 3]2022
3             Japan      Asia    4409738       2023        4231141       2022
4           Germany    Europe    4308854       2023        4072192       2022

  United Nations[15]
            Estimate       Year
0           96698005       2021
1           23315081       2021
2           17734131  [n 1]2021
3            4940878       2021
4            4259935       2021

In [5]:
df.shape

df.columns

MultiIndex([( 'Country/Territory', 'Country/Territory'),
            (         'UN region',         'UN region'),
            (        'IMF[1][13]',          'Estimate'),
            (        'IMF[1][13]',              'Year'),
            (    'World Bank[14]',          'Estimate'),
            (    'World Bank[14]',              'Year'),
            ('United Nations[15]',          'Estimate'),
            ('United Nations[15]',              'Year')],
           )

In [6]:
df.columns = range(df.shape[1]) 
df.head()

,0,1,2,3,4,5,6,7
0,World,—,105568776,2023,100562011,2022,96698005,2021
1,United States,Americas,26854599,2023,25462700,2022,23315081,2021
2,China,Asia,19373586,[n 1]2023,17963171,[n 3]2022,17734131,[n 1]2021
3,Japan,Asia,4409738,2023,4231141,2022,4940878,2021
4,Germany,Europe,4308854,2023,4072192,2022,4259935,2021

In [7]:
df = df[[0,2]]

df

                 0          2
0            World  105568776
1    United States   26854599
2            China   19373586
3            Japan    4409738
4          Germany    4308854
..             ...        ...
209       Anguilla          —
210       Kiribati        248
211          Nauru        151
212     Montserrat          —
213         Tuvalu         65

[214 rows x 2 columns]

In [8]:
df = df.iloc[1:11,:]
df

                 0         2
1    United States  26854599
2            China  19373586
3            Japan   4409738
4          Germany   4308854
5            India   3736882
6   United Kingdom   3158938
7           France   2923489
8            Italy   2169745
9           Canada   2089672
10          Brazil   2081235

In [10]:
df.columns = ["Country", "GDP"]

In [14]:
type(df["GDP"])

pandas.core.series.Series

In [16]:
df["GDP"]=df["GDP"].astype(int)

Convert the GDP value in Million USD to Billions USD

In [18]:
df[["GDP"]]=df[["GDP"]]/1000

In [19]:
df

           Country        GDP
1    United States  26854.599
2            China  19373.586
3            Japan   4409.738
4          Germany   4308.854
5            India   3736.882
6   United Kingdom   3158.938
7           France   2923.489
8            Italy   2169.745
9           Canada   2089.672
10          Brazil   2081.235

Use numpy.round() method to round the values to 2 decimal places.

In [21]:
df[["GDP"]]=np.round(df[["GDP"]],2)

In [22]:
df

           Country       GDP
1    United States  26854.60
2            China  19373.59
3            Japan   4409.74
4          Germany   4308.85
5            India   3736.88
6   United Kingdom   3158.94
7           France   2923.49
8            Italy   2169.74
9           Canada   2089.67
10          Brazil   2081.24

In [23]:
df.rename(columns={"GDP": "GDP (Billion USD)"})

           Country  GDP (Billion USD)
1    United States           26854.60
2            China           19373.59
3            Japan            4409.74
4          Germany            4308.85
5            India            3736.88
6   United Kingdom            3158.94
7           France            2923.49
8            Italy            2169.74
9           Canada            2089.67
10          Brazil            2081.24

Load the DataFrame to the CSV file named "Largest_economeis.csv"

In [24]:
df.to_csv("./Largest_economies.csv")